# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, nn.MaxPool2d, [2]],
  
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, nn.MaxPool2d, [2]],
  
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, nn.MaxPool2d, [2]],

  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, nn.MaxPool2d, [2]],

  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, Conv, [128, 3, 1]],  # 1-P2/4
  [-1, 1, nn.MaxPool2d, [2]],
  
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  
  [-1, 1, Conv, [1, 3, 1]],
  ]

# YOLOv5 head
head:
  [
  ]
